content-org/posts.org
#+hugo_base_dir: ../
#+hugo_level_offset: 1
#+seq_todo: TODO DONE
#+startup: indent
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: admonition
#+hugo_front_matter_key_replace: description>featuredImage
#+author:
#+hugo_custom_front_matter: :author "Matt Maguire"
#+filetags: @Blog

*** DONE Japanese Electronic Dictionary XD-Z20000 :Languages:Japanese:
:PROPERTIES:
:CUSTOM_ID: xd-z20000
:EXPORT_FILE_NAME: index.md
:EXPORT_HUGO_BUNDLE: 20250320-denshijisho_xd-z20000
:EXPORT_DATE: 2025-03-20
:EXPORT_HUGO_MENU:
:EXPORT_DESCRIPTION: 20250320-xd_z20000.jpg
:END:

Last time I talked about a [[#xd-g9850][science-related electronic dictionary]] that I bought in Japan. When I was there, I did a bit more research and discovered that I had rushed in too quickly and that there were other models that include more business and literature-related content that could be useful when studying Japanese. So, I purchased a second dictionary, the Casio XD-Z20000. So, how much of an upgrade was this compared to the scientific model XD-G9850? To answer this question, I listed out all the dictionaries, glossaries and encyclopedias from both models and put them in a table for comparison, which you can find below. It shows under which category each dictionary is found on the two devices. I didn 't bother looking at the English Training Gym sections, as English is already my native tongue, and hence I think it would be of little benefit to analyse it.

**** Comparing Japanese Dictionaries
So, what are the main differences between the two devices? Some observations I made were:
- The Z20000 has almost all the content that the G9850 has, except for a couple of minor content that is likely already covered by other collections in the Z20000.
- The Z20000 has more extensive English language dictionaries from Oxford.
- It has some extra Japanese language dictionaries such as Obunsha classical Japanese, Random House and O'Rex J-E Dictionaries.
- The Z20000 has more biology content than the G9850, which is focused more on Physics and Chemistry.
- The Z20000 also has some other interesting-looking content such as "Obfuscated Kanji" (whatever that may be), Japanese etymology, and other content on history, culture, and everyday living.

So, what do I conclude? Well, I could have saved my money by going straight for the Z20000, and I wouldn't have missed anything of consequence. Having said that, realistically the G9850 has way more content than I could possibly need at my beginner level of Japanese, and everything would have been fine if I had just stuck with the G9850. Not to worry, it can serve as a back-up to the Z20000.

**** What about Chinese?
When I was in Japan, I actually bought a third electronic dictionary, this one covering Chinese and Japanese. My Chinese level is even lower than my Japanese, but I thought that I could use such a dictionary to support the learning of both languages using the [[https://ai.glossika.com/blog/language-laddering][laddering technique]]. Chinese is probably a more useful language to me than Japanese, but somehow I find Japanese much more fun, which means I have trouble deciding which to focus on. As the girl says in a taco ad where her family argues between soft or hard taco shells, "Por qué no los dos?".

