content-org/posts.org
**** Comparison Table

|-----------------------------------+---------------------------+-----------------+-----------------|
| 辞書                              | Description               | XD-G9850        | XD-Z20000       |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 精選版 日本国語大辞典                | SELECT EDITOR             | ======          | 国語系１         |
| 広辞苑                             | Kojien                    | ======          | 国語系１         |
| デジタル大辞泉                      | Digital Daijisen          | 国語系１         | ======          |
| 明鏡国語辞典                        | Myogakyo                  | 国語系１         | 国語系１         |
| 新明解国語辞典                      | Shinmei                   | 国語系１         | 国語系１         |
| 新漢語林                           | New CN Language Forest    | ======          | 国語系１         |
| NHK 日本語発音アクセント辞典          | NHK JP Pronunciation      | 国語系１         | 国語系１         |
| 日本語大シソーラス                   | JP Great Thesaurus        | ======          | 国語系１         |
| 角川類語新辞典                      | Kadokawa Slang            | 国語系１         | 国語系１         |
| 類語例解辞典                        | Synonyms                  | 国語系１         | 国語系１         |
| 三省堂 反対語便覧                    | Sansei-do Antonyms        | 国語系１         | 国語系１         |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 日本語コロケーション辞典              | JP Colocation             | 国語系１         | 国語系２         |
| 現代カタカナ語辞典                   | Modern Katakana           | 国語系１         | 国語系２         |
| 旺文社古語辞典                      | Obunsha Kogoji            | ======          | 国語系２         |
| 旺文社全訳古語辞典                   | Obunsha Classical JP      | ======          | 国語系２         |
| 大修館･全訳古語辞典                  | Taishukan Old JP          | 国語系２         | ======          |
| 明鏡 ことわざ成句使い方辞典           | Myokyo Proverbs/Lyrics    | 国語系２         | 国語系２         |
| 大修館 四字熟語辞典                  | Daishukan 4-Char Idioms   | 国語系２         | 国語系２         |
| NHK 漢字表記辞典                    | NHK Kanji                 | ======          | 国語系２         |
| 楷行草 筆順字典                     | Cursive Kanji             | 国語系２         | 国語系２         |
|-----------------------------------+---------------------------+-----------------+-----------------|
| リーダーズ英和辞典／リーダーズ･プラス   | Readers E-J               | 英語系１         | 英語系１         |
| 新英和大辞典                        | New E-J                   | ======          | 英語系１         |
| ジーニアス英和大辞典                 | Genius E-J Big            | 英語系１         | 英語系１         |
| ランダムハウス英和大辞典              | Random House E-J          | ======          | 英語系１         |
| オックスフォード新英英辞典            | Oxford New English        | ======          | 英語系１         |
| オックスフォード米語辞典              | Oxford American           | ======          | 英語系１         |
| ジーニアス英和辞典                   | Genius E-J                | 英語系１         | 英語系１         |
| ウィズダム英和辞典                   | Wisdom E-J                | 英語系１         | 英語系１         |
| オーレックス英和辞典                 | O'Rex E-J                 | ======          | 英語系１         |
| 理化学英和辞典                      | Physics/Chem. E-J         | 英語系１         | ======          |
| 自然科学系英和大辞典                 | Nat. Sci E-J              | 英語系１         | 英語系１         |
|-----------------------------------+---------------------------+-----------------+-----------------|
| オックスフォード現代英英辞典           | Oxford Modern E           | 英語系１         | 英語系２         |
| ロングマン現代英英辞典                | Longman Modern E          | ======          | 英語系２         |
| 200 万語専門用語 英和･和英大辞典       | 2M words E-J-E            | 英語系１         | 英語系２         |
| 英和活用大辞典                      | E-J Usage                 | 英語系１         | 英語系２         |
| オックスフォード類語辞典              | Oxford Synonyms           | ======          | 英語系２         |
| オックスフォード連語辞典              | Oxford Lexicon            | ======          | 英語系２         |
| オックスフォード英英活用辞典           | Oxford E-E                | ======          | 英語系２         |
| オックスフォードイディオム辞典         | Oxford Idioms             | ======          | 英語系２         |
| オックスフォード句動詞辞典            | Oxford Phrasal Verbs      | ======          | 英語系２         |
| ロングマン英語アクティベータ           | Longman E Activator       | ======          | 英語系２         |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 新和英大辞典                        | New J-E                   | ======          | 英語系３         |
| ジーニアス和英辞典                   | Genius J-E                | 英語系２         | 英語系３         |
| ウィズダム和英辞典                   | Wisdom J-E                | 英語系２         | 英語系３         |
| オーレックス和英辞典                 | O'Rex J-E                 | ======          | 英語系３         |
| 自然科学系和英大辞典                 | Nat. Sci J-E              | 英語系２         | 英語系３         |
| 英語類語辞典                        | EN Synonyms               | 英語系２         | 英語系３         |
| カタカナで引くスペリング辞典           | Katakana Spelling         | 英語系２         | 英語系３         |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 発音トレーニング                     | Pronunciation             | 英会話・トラベル１ | 英会話・トラベル１ |
| 英会話スキット･トレーニング            | Skits                     | 英会話・トラベル１ | 英会話・トラベル１ |
| ｢英語の耳｣になる!                   | EN Ear                    | 英会話・トラベル１ | 英会話・トラベル１ |
| キクタン英会話 初級編                | Kikutan Conversation      | 英会話・トラベル１ | 英会話・トラベル１ |
| キクタン                           | Kikutan                   | 英会話・トラベル１ | 英会話・トラベル１ |
| NHK ラジオ                         | NHK Radio                 | 英会話・トラベル１ | ======          |
| 英語発音クリニック                   | EN Pronunciation Clinic   | 英会話・トラベル１ | ======          |
| アメリカ英語表現辞典                 | US EN Expressions         | ======          | 英会話・トラベル１ |
| 英語名演説･名せりふ集                | EN Speeches & Lines       | ======          | 英会話・トラベル１ |
|-----------------------------------+---------------------------+-----------------+-----------------|
| とっておきの英会話表現辞典            | Special EN                | 英会話・トラベル２ | 英会話・トラベル２ |
| 英会話とっさのひとこと辞典            | EN Conversation           | 英会話・トラベル２ | 英会話・トラベル２ |
| 英会話海外旅行ひとこと辞典            | Overseas Travel           | 英会話・トラベル２ | 英会話・トラベル２ |
| 英会話ビジネスひとこと辞典            | EN Business               | ======          | 英会話・トラベル２ |
| ひとり歩きの会話集(16 言語)           | Multilingual Travel       | 英会話・トラベル２ | 英会話・トラベル２ |
| 怪我と病気の英語力                   | EN Injury & Illness       | 英会話・トラベル２ | 英会話・トラベル２ |
| 一生に一度だけの旅                   | Once in a lifetime trip   | ======          | 英会話・トラベル２ |
| ドクターパスポート                   | Doctor Passport           | 英会話・トラベル２ | 英会話・トラベル２ |
| トラブルパスポート                   | Travel Passport           | 英会話・トラベル２ | 英会話・トラベル２ |
| 世界の料理･メニュー辞典               | World Cuisine/Menu        | 英会話・トラベル２ | 英会話・トラベル２ |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 日本大百科全書(ニッポニカ)            | Encycl Nipponica          | 生活・実用１      | 生活・実用１      |
| ブリタニカ国際大百科事典              | Britannica Int. Encycl    | 生活・実用１      | 生活・実用１      |
| 百科事典マイペディア                 | Encycl Mypedia            | 生活・実用１      | 生活・実用１      |
| ビジュアル 大世界史                  | Visual World History      | 生活・実用１      | 生活・実用１      |
| ビジュアル 科学大事典                | Visual Science            | 生活・実用１      | 生活・実用１      |
| 里山の昆虫ハンドブック                | Satoyama Insect           | ======          | 生活・実用１      |
| 里山の植物ハンドブック                | Sanoyama Plant            | ======          | 生活・実用１      |
| 新ヤマケイポケットガイド 野鳥          | New Yamakei Birds         | ======          | 生活・実用１      |
| 新ヤマケイポケットガイド 海水魚        | New Yamakei Fish          | ======          | 生活・実用１      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| ブリタニカ･コンサイス百科事典(英語)     | Concise Britannica        | ======          | 生活・実用２      |
| 日本歴史大事典                      | JP History                | ======          | 生活・実用２      |
| エピソードで読む世界の国 243          | World Countries           | ======          | 生活・実用２      |
| 和英：日本の文化･観光･歴史辞典         | J-E JP Tourist/History    | 生活・実用１      | 生活・実用２      |
| 日本－その姿と心－                   | JP Appearance & Heart     | 生活・実用１      | 生活・実用２      |
| 家族みんなのバランスごはん            | Whole Family Balance      | ======          | 生活・実用２      |
| 冠婚葬祭マナー事典                   | Ceremonies                | 生活・実用２      | 生活・実用２      |
| すぐに使える 基本法律用語辞典          | Basic Legal Glossary      | 生活・実用２      | 生活・実用２      |
| 日本国憲法                         | JP Constitution           | ======          | 生活・実用２      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 数え方の辞典                        | Mathematics               | 生活・実用２      | 生活・実用３      |
| みんなで国語辞典!                    | Everyday JP               | 生活・実用２      | 生活・実用３      |
| 問題な日本語                        | Problem JP                | 生活・実用２      | 生活・実用３      |
| 常用漢字の難読辞典                   | Obfuscated Kanji          | ======          | 生活・実用３      |
| 日本語｢語源｣辞典                    | JP Etymology              | ======          | 生活・実用３      |
| 日本語○×辞典                       | JP Mistakes               | ======          | 生活・実用３      |
| 敬語早わかり辞典                     | Biling. Early Underst.    | ======          | 生活・実用３      |
| 言葉の作法辞典                      | Glossary                  | ======          | 生活・実用３      |
| 日本語知識辞典                      | JP Knowledge              | ======          | 生活・実用３      |
| 続･日本語知識辞典                    | Cont. JP Knowledge        | ======          | 生活・実用３      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 全国方言一覧辞典                     | List JP Dialects          | ======          | 生活・実用４      |
| 手紙文例集                         | Letters, Examples         | ======          | 生活・実用４      |
| スピーチ文例集                      | Speech Examples           | ======          | 生活・実用４      |
| 家庭医学大事典                      | Family Medicine           | ======          | 生活・実用４      |
| 薬の手引き                         | Medication Guide          | ======          | 生活・実用４      |
| サプリメント事典                     | Suppl. Encycl             | ======          | 生活・実用４      |
| イヌ･ネコ 家庭動物の医学大百科         | Dogs, Cats, Vet           | ======          | 生活・実用４      |
| 日本文学 2000 作品                  | 2K JP Literature          | 生活・実用２      | 生活・実用４      |
| 世界文学 1000 作品                  | 1K World Literature       | 生活・実用２      | 生活・実用４      |
| クラシック名曲 2000 フレーズ          | 2K Phrase (Classics)      | 生活・実用２      | 生活・実用４      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 関東周辺 週末の山登りベスト 120       | Kanto Mtn Climbing        | ======          | 生活・実用５      |
| 関西周辺 週末の山登りベスト 120       | Kansai Mtn Climbing       | ======          | 生活・実用５      |
| 日本三百名山 登山ガイド               | 300 Famous Mtn Guide      | ======          | 生活・実用５      |
| ビジュアル･ワイド 日本名城百選         | 100 JP Castles            | ======          | 生活・実用５      |
| ビジュアル･ワイド 日本の城            | Visual JP Castles         | ======          | 生活・実用５      |
| 角川俳句大歳時記                     | Kadokawa Haiku            | ======          | 生活・実用５      |
| ホトトギス俳句季題便覧                | Hottogisu Haiku           | ======          | 生活・実用５      |
| 合本俳句歳時記                      | Toshiki Haiku             | ======          | 生活・実用５      |
| スポーツ用語辞典                     | Sports Terms              | 生活・実用２      | 生活・実用５      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 経済･経営用語辞典                    | Econ+Mgmt Terms           | 実務・情報       | 実務・情報１      |
| 図解雑学ドラッカー経営学              | Drucker Mgmt              | ======          | 実務・情報１      |
| 図解雑学マルクス経済学                | Marxist Econ              | ======          | 実務・情報１      |
| 図解雑学ケインズ経済学                | Keynsian Econ             | ======          | 実務・情報１      |
| プロフェッショナル用語辞典            | Professional Glossary     | 実務・情報       | 実務・情報１      |
| 経営のヒントとなる言葉 50             | 50 Business Tips          | 実務・情報       | 実務・情報１      |
| 名経営者の至言                      | Business Owner Words      | 実務・情報       | 実務・情報１      |
| 気配り美人のビジネスマナー ･ハンドブック | Business Ettiquete        | 実務・情報       | ======          |
| 経済･ビジネス用語辞典                | Econ+Business Terms       | 実務・情報       | 実務・情報１      |
| ビジネス便利事典                     | Business Convenience      | 実務・情報       | 実務・情報１      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| バロンズ金融用語辞典                 | Barron's Fin. Terms       | ======          | 実務・情報２      |
| NHK 出版 英語イディオム辞典           | NHK EN Idioms             | 実務・情報       | 実務・情報２      |
| 経済ビジネス英語表現辞典              | Econ+Bus EN Expressions   | ======          | 実務・情報２      |
| 経済･ビジネス英語 2 万語辞典          | Econ+Bus EN               | ======          | 実務・情報２      |
| オックスフォードビジネス英語辞典        | Oxford Business EN        | ======          | 実務・情報２      |
| ビジネス英語スーパー辞典              | Bus. EN Super             | 実務・情報       | 実務・情報２      |
| ビジネス英語の最強フレーズ            | Strong Bus. EN Phrases    | ======          | 実務・情報２      |
| 英文 E メール 200 の鉄則             | 200 EN Email Laws         | ======          | 実務・情報２      |
| 英文手紙用例辞典                     | English Letters           | ======          | 実務・情報２      |
|-----------------------------------+---------------------------+-----------------+-----------------|
| TOEIC®テストスコアアップ            | TOEIC Score App           | ======          | TOEIC®テスト    |
| TOEIC®テストハイパー模試            | TOEIC Test                | ======          | TOEIC®テスト    |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 百人一首                           | 100 Poets                 | ======          | 学習１           |
| 国語名作集(古文･現代文)              | JP Masterpieces (old+mod) | ======          | 学習１           |
| 国語名作集(漢文)                    | JP Masterpieces (CN)      | ======          | 学習１           |
| 近現代文学／古典文学／名歌名句         | Mod./Classic Lit+Songs    | ======          | 学習１           |
| 実践ロイヤル英文法                   | Royal EN Grammar          | ======          | 学習１           |
| ロイヤル英文法                      | Royal EN                  | ======          | 学習１           |
| 論文･スピーチの英語表現               | EN Papers+Speeches        | ======          | 学習１           |
|-----------------------------------+---------------------------+-----------------+-----------------|
| 旺文社 生物事典                     | Obunsha Bio Encycl        | ======          | 学習２           |
| 旺文社 物理事典                     | Obunsha Physics           | ======          | 学習２           |
| 旺文社 化学事典                     | Obunsha Chemical          | ======          | 学習２           |
| 山川 日本史小辞典                    | Yamakawa JP History       | ======          | 学習２           |
| 山川 世界史小辞典                    | Yamakawa World History    | ======          | 学習２           |
| もういちど読む山川                   | Read it again, Yamakawa   | ======          | 学習２           |
| 論点解説 日経 TEST                  | Nikkei Test Explan.       | ======          | 学習２           |
| 日経 TEST 公式練習問題集             | Nikkei Test Practice Qs   | ======          | 学習２           |
|-----------------------------------+---------------------------+-----------------+-----------------|

